11/data/attachments/5602d334d69489d7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_3cce276b-56df-4d1c-a74c-b21e3d16c583</nif:username>
            <nif:friendToBeAdded>Arthur_student_Actions_45912_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>